rhthomas/KW41Z-Dev/MCUXpresso/LEDtest/pin_mux.h
#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_


/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* PORTC4 (number 40), J1[5]/D4/SW3 */
#define BOARD_SW3_GPIO                                                     GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_SW3_PORT                                                     PORTC   /*!< PORT device name: PORTC */
#define BOARD_SW3_GPIO_PIN                                                    4U   /*!< PORTC pin index: 4 */
#define BOARD_SW3_PIN_NAME                                                  PTC4   /*!< Pin name */
#define BOARD_SW3_LABEL                                           "J1[5]/D4/SW3"   /*!< Label */
#define BOARD_SW3_NAME                                                     "SW3"   /*!< Identifier name */
#define BOARD_SW3_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */

/* PORTC5 (number 41), J3[1]/SW4 */
#define BOARD_SW4_GPIO                                                     GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_SW4_PORT                                                     PORTC   /*!< PORT device name: PORTC */
#define BOARD_SW4_GPIO_PIN                                                    5U   /*!< PORTC pin index: 5 */
#define BOARD_SW4_PIN_NAME                                                  PTC5   /*!< Pin name */
#define BOARD_SW4_LABEL                                              "J3[1]/SW4"   /*!< Label */
#define BOARD_SW4_NAME                                                     "SW4"   /*!< Identifier name */
#define BOARD_SW4_DIRECTION                              kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtons(void);

/* PORTA19 (number 7), J2[3]/D10/RGB_GREEN */
#define BOARD_LED_GREEN_GPIO                                               GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_LED_GREEN_PORT                                               PORTA   /*!< PORT device name: PORTA */
#define BOARD_LED_GREEN_GPIO_PIN                                             19U   /*!< PORTA pin index: 19 */
#define BOARD_LED_GREEN_PIN_NAME                                           PTA19   /*!< Pin name */
#define BOARD_LED_GREEN_LABEL                              "J2[3]/D10/RGB_GREEN"   /*!< Label */
#define BOARD_LED_GREEN_NAME                                         "LED_GREEN"   /*!< Identifier name */
#define BOARD_LED_GREEN_DIRECTION                       kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTA18 (number 6), J2[6]/D13/RGB_BLUE */
#define BOARD_LED_BLUE_GPIO                                                GPIOA   /*!< GPIO device name: GPIOA */
#define BOARD_LED_BLUE_PORT                                                PORTA   /*!< PORT device name: PORTA */
#define BOARD_LED_BLUE_GPIO_PIN                                              18U   /*!< PORTA pin index: 18 */
#define BOARD_LED_BLUE_PIN_NAME                                            PTA18   /*!< Pin name */
#define BOARD_LED_BLUE_LABEL                                "J2[6]/D13/RGB_BLUE"   /*!< Label */
#define BOARD_LED_BLUE_NAME                                           "LED_BLUE"   /*!< Identifier name */
#define BOARD_LED_BLUE_DIRECTION                        kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTC1 (number 37), J2[2]/U9[11]/D9/RGB_RED/INT1_COMBO */
#define BOARD_LED_RED_GPIO                                                 GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_LED_RED_PORT                                                 PORTC   /*!< PORT device name: PORTC */
#define BOARD_LED_RED_GPIO_PIN                                                1U   /*!< PORTC pin index: 1 */
#define BOARD_LED_RED_PIN_NAME                                              PTC1   /*!< Pin name */
#define BOARD_LED_RED_LABEL                 "J2[2]/U9[11]/D9/RGB_RED/INT1_COMBO"   /*!< Label */
#define BOARD_LED_RED_NAME                                             "LED_RED"   /*!< Identifier name */
#define BOARD_LED_RED_DIRECTION                         kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTB0 (number 16), LED3 */
#define BOARD_LED_COMM_GPIO                                                GPIOB   /*!< GPIO device name: GPIOB */
#define BOARD_LED_COMM_PORT                                                PORTB   /*!< PORT device name: PORTB */
#define BOARD_LED_COMM_GPIO_PIN                                               0U   /*!< PORTB pin index: 0 */
#define BOARD_LED_COMM_PIN_NAME                                             PTB0   /*!< Pin name */
#define BOARD_LED_COMM_LABEL                                              "LED3"   /*!< Label */
#define BOARD_LED_COMM_NAME                                           "LED_COMM"   /*!< Identifier name */
#define BOARD_LED_COMM_DIRECTION                        kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

