rhthomas/KW41Z-Dev/MCUXpresso/LEDtest/pin_mux.h
/* PORTC7 (number 43), J1[2]/D1/UART0_TX_TGTMCU */
#define BOARD_DEBUG_UART_TX_PERIPHERAL                                   LPUART0   /*!< Device name: LPUART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL                                            TX   /*!< LPUART0 signal: TX */
#define BOARD_DEBUG_UART_TX_PIN_NAME                                    UART0_TX   /*!< Pin name */
#define BOARD_DEBUG_UART_TX_LABEL                     "J1[2]/D1/UART0_TX_TGTMCU"   /*!< Label */
#define BOARD_DEBUG_UART_TX_NAME                                 "DEBUG_UART_TX"   /*!< Identifier name */
#define BOARD_DEBUG_UART_TX_DIRECTION                   kPIN_MUX_DirectionOutput   /*!< Direction */

/* PORTC6 (number 42), J1[1]/D0/UART0_RX_TGTMCU */
#define BOARD_DEBUG_UART_RX_PERIPHERAL                                   LPUART0   /*!< Device name: LPUART0 */
#define BOARD_DEBUG_UART_RX_SIGNAL                                            RX   /*!< LPUART0 signal: RX */
#define BOARD_DEBUG_UART_RX_PIN_NAME                                    UART0_RX   /*!< Pin name */
#define BOARD_DEBUG_UART_RX_LABEL                     "J1[1]/D0/UART0_RX_TGTMCU"   /*!< Label */
#define BOARD_DEBUG_UART_RX_NAME                                 "DEBUG_UART_RX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

/* XTAL (number 31), Y1[1]/XTAL_32M */
#define BOARD_XTAL_PERIPHERAL                                              RADIO   /*!< Device name: RADIO */
#define BOARD_XTAL_SIGNAL                                                   XTAL   /*!< RADIO signal: XTAL */
#define BOARD_XTAL_PIN_NAME                                                 XTAL   /*!< Pin name */
#define BOARD_XTAL_LABEL                                        "Y1[1]/XTAL_32M"   /*!< Label */
#define BOARD_XTAL_NAME                                                   "XTAL"   /*!< Identifier name */

/* EXTAL (number 30), Y1[3]/EXTAL_32M */
#define BOARD_EXTAL_PERIPHERAL                                             RADIO   /*!< Device name: RADIO */
#define BOARD_EXTAL_SIGNAL                                                 EXTAL   /*!< RADIO signal: EXTAL */
#define BOARD_EXTAL_PIN_NAME                                               EXTAL   /*!< Pin name */
#define BOARD_EXTAL_LABEL                                      "Y1[3]/EXTAL_32M"   /*!< Label */
#define BOARD_EXTAL_NAME                                                 "EXTAL"   /*!< Identifier name */

/* PORTB17 (number 22), Y2[1]/XTAL_32K */
#define BOARD_XTAL32K_PERIPHERAL                                             RTC   /*!< Device name: RTC */
#define BOARD_XTAL32K_SIGNAL                                             XTAL32K   /*!< RTC signal: XTAL32K */
#define BOARD_XTAL32K_PIN_NAME                                           XTAL32K   /*!< Pin name */
#define BOARD_XTAL32K_LABEL                                     "Y2[1]/XTAL_32K"   /*!< Label */
#define BOARD_XTAL32K_NAME                                             "XTAL32K"   /*!< Identifier name */

/* PORTB16 (number 21), Y2[2]/EXTAL_32K */
#define BOARD_EXTAL32K_PERIPHERAL                                            RTC   /*!< Device name: RTC */
#define BOARD_EXTAL32K_SIGNAL                                           EXTAL32K   /*!< RTC signal: EXTAL32K */
#define BOARD_EXTAL32K_PIN_NAME                                         EXTAL32K   /*!< Pin name */
#define BOARD_EXTAL32K_LABEL                                   "Y2[2]/EXTAL_32K"   /*!< Label */
#define BOARD_EXTAL32K_NAME                                           "EXTAL32K"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSC(void);

/* PORTC3 (number 39), J2[9]/U9[6]/D14/I2C1_SDA */
#define BOARD_ACCEL_SDA_PERIPHERAL                                          I2C1   /*!< Device name: I2C1 */
#define BOARD_ACCEL_SDA_SIGNAL                                               SDA   /*!< I2C1 signal: SDA */
#define BOARD_ACCEL_SDA_PIN_NAME                                        I2C1_SDA   /*!< Pin name */
#define BOARD_ACCEL_SDA_LABEL                         "J2[9]/U9[6]/D14/I2C1_SDA"   /*!< Label */
#define BOARD_ACCEL_SDA_NAME                                         "ACCEL_SDA"   /*!< Identifier name */

/* PORTC2 (number 38), J2[10]/U9[4]/D15/I2C1_SCL */
#define BOARD_ACCEL_SCL_PERIPHERAL                                          I2C1   /*!< Device name: I2C1 */
#define BOARD_ACCEL_SCL_SIGNAL                                               CLK   /*!< I2C1 signal: CLK */
#define BOARD_ACCEL_SCL_PIN_NAME                                        I2C1_SCL   /*!< Pin name */
#define BOARD_ACCEL_SCL_LABEL                        "J2[10]/U9[4]/D15/I2C1_SCL"   /*!< Label */
#define BOARD_ACCEL_SCL_NAME                                         "ACCEL_SCL"   /*!< Identifier name */

/* PORTC1 (number 37), J2[2]/U9[11]/D9/RGB_RED/INT1_COMBO */
#define BOARD_ACCEL_INT1_GPIO                                              GPIOC   /*!< GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_PORT                                              PORTC   /*!< PORT device name: PORTC */
#define BOARD_ACCEL_INT1_GPIO_PIN                                             1U   /*!< PORTC pin index: 1 */
#define BOARD_ACCEL_INT1_PIN_NAME                                           PTC1   /*!< Pin name */
#define BOARD_ACCEL_INT1_LABEL              "J2[2]/U9[11]/D9/RGB_RED/INT1_COMBO"   /*!< Label */
#define BOARD_ACCEL_INT1_NAME                                       "ACCEL_INT1"   /*!< Identifier name */
#define BOARD_ACCEL_INT1_DIRECTION                       kPIN_MUX_DirectionInput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL(void);

/* PORTC17 (number 46), J1[6]/U4[1]/D5 */
#define BOARD_FLASH_SI_PERIPHERAL                                           SPI0   /*!< Device name: SPI0 */
#define BOARD_FLASH_SI_SIGNAL                                               SOUT   /*!< SPI0 signal: SOUT */
#define BOARD_FLASH_SI_PIN_NAME                                        SPI0_SOUT   /*!< Pin name */
#define BOARD_FLASH_SI_LABEL                                    "J1[6]/U4[1]/D5"   /*!< Label */
#define BOARD_FLASH_SI_NAME                                           "FLASH_SI"   /*!< Identifier name */

/* PORTC18 (number 47), J1[7]/U4[8]/D6 */
#define BOARD_FLASH_SO_PERIPHERAL                                           SPI0   /*!< Device name: SPI0 */
#define BOARD_FLASH_SO_SIGNAL                                                SIN   /*!< SPI0 signal: SIN */
#define BOARD_FLASH_SO_PIN_NAME                                         SPI0_SIN   /*!< Pin name */
#define BOARD_FLASH_SO_LABEL                                    "J1[7]/U4[8]/D6"   /*!< Label */
#define BOARD_FLASH_SO_NAME                                           "FLASH_SO"   /*!< Identifier name */

/* PORTC16 (number 45), J1[4]/U4[2]/D3/SW5 */
#define BOARD_FLASH_SCK_PERIPHERAL                                          SPI0   /*!< Device name: SPI0 */
#define BOARD_FLASH_SCK_SIGNAL                                               SCK   /*!< SPI0 signal: SCK */
#define BOARD_FLASH_SCK_PIN_NAME                                        SPI0_SCK   /*!< Pin name */
#define BOARD_FLASH_SCK_LABEL                               "J1[4]/U4[2]/D3/SW5"   /*!< Label */
#define BOARD_FLASH_SCK_NAME                                         "FLASH_SCK"   /*!< Identifier name */
#define BOARD_FLASH_SCK_DIRECTION                       kPIN_MUX_DirectionOutput   /*!< Direction */

