rhthomas/KW41Z-Dev/MCUXpresso/LEDtest/pin_mux.h
/* PORTC19 (number 48), J1[3]/U4[4]/D2/SW2 */
#define BOARD_FLASH_CS_PERIPHERAL                                           SPI0   /*!< Device name: SPI0 */
#define BOARD_FLASH_CS_SIGNAL                                            PCS0_SS   /*!< SPI0 signal: PCS0_SS */
#define BOARD_FLASH_CS_PIN_NAME                                        SPI0_PCS0   /*!< Pin name */
#define BOARD_FLASH_CS_LABEL                                "J1[3]/U4[4]/D2/SW2"   /*!< Label */
#define BOARD_FLASH_CS_NAME                                           "FLASH_CS"   /*!< Identifier name */
#define BOARD_FLASH_CS_DIRECTION                        kPIN_MUX_DirectionOutput   /*!< Direction */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFLASH(void);

/* ADC0_DM0 (number 25), J4[1]/THER_B */
#define BOARD_ADC0_DM_THER_PERIPHERAL                                       ADC0   /*!< Device name: ADC0 */
#define BOARD_ADC0_DM_THER_SIGNAL                                             DM   /*!< ADC0 signal: DM */
#define BOARD_ADC0_DM_THER_CHANNEL                                             0   /*!< ADC0 DM channel: 0 */
#define BOARD_ADC0_DM_THER_PIN_NAME                                     ADC0_DM0   /*!< Pin name */
#define BOARD_ADC0_DM_THER_LABEL                                  "J4[1]/THER_B"   /*!< Label */
#define BOARD_ADC0_DM_THER_NAME                                   "ADC0_DM_THER"   /*!< Identifier name */

/* ADC0_DP0 (number 24), J4[6]/J35[2]/V_BATT/THER_A/THERMISTOR */
#define BOARD_ADC0_DP_THER_PERIPHERAL                                       ADC0   /*!< Device name: ADC0 */
#define BOARD_ADC0_DP_THER_SIGNAL                                             DP   /*!< ADC0 signal: DP */
#define BOARD_ADC0_DP_THER_CHANNEL                                             0   /*!< ADC0 DP channel: 0 */
#define BOARD_ADC0_DP_THER_PIN_NAME                                     ADC0_DP0   /*!< Pin name */
#define BOARD_ADC0_DP_THER_LABEL         "J4[6]/J35[2]/V_BATT/THER_A/THERMISTOR"   /*!< Label */
#define BOARD_ADC0_DP_THER_NAME                                   "ADC0_DP_THER"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitThermistor(void);

/* ADC0_DP0 (number 24), J4[6]/J35[2]/V_BATT/THER_A/THERMISTOR */
#define BOARD_ADC0_BATT_MON_PERIPHERAL                                      ADC0   /*!< Device name: ADC0 */
#define BOARD_ADC0_BATT_MON_SIGNAL                                            SE   /*!< ADC0 signal: SE */
#define BOARD_ADC0_BATT_MON_CHANNEL                                            0   /*!< ADC0 SE channel: 0 */
#define BOARD_ADC0_BATT_MON_PIN_NAME                                    ADC0_DP0   /*!< Pin name */
#define BOARD_ADC0_BATT_MON_LABEL        "J4[6]/J35[2]/V_BATT/THER_A/THERMISTOR"   /*!< Label */
#define BOARD_ADC0_BATT_MON_NAME                                 "ADC0_BATT_MON"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBatteryMonitor(void);

/* PORTB1 (number 17), J4[5]/IR_SIG */
#define BOARD_IR_TX_PERIPHERAL                                               CMT   /*!< Device name: CMT */
#define BOARD_IR_TX_SIGNAL                                                   IRO   /*!< CMT signal: IRO */
#define BOARD_IR_TX_PIN_NAME                                             CMT_IRO   /*!< Pin name */
#define BOARD_IR_TX_LABEL                                         "J4[5]/IR_SIG"   /*!< Label */
#define BOARD_IR_TX_NAME                                                 "IR_TX"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitInfraLed(void);

/* PORTC16 (number 45), J1[4]/U4[2]/D3/SW5 */
#define BOARD_TSI_ELECTRODE_1_PERIPHERAL                                    TSI0   /*!< Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_1_SIGNAL                                          CH   /*!< TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_1_CHANNEL                                          4   /*!< TSI0 channel: 4 */
#define BOARD_TSI_ELECTRODE_1_PIN_NAME                                  TSI0_CH4   /*!< Pin name */
#define BOARD_TSI_ELECTRODE_1_LABEL                         "J1[4]/U4[2]/D3/SW5"   /*!< Label */
#define BOARD_TSI_ELECTRODE_1_NAME                             "TSI_ELECTRODE_1"   /*!< Identifier name */

/* PORTC19 (number 48), J1[3]/U4[4]/D2/SW2 */
#define BOARD_TSI_ELECTRODE_2_PERIPHERAL                                    TSI0   /*!< Device name: TSI0 */
#define BOARD_TSI_ELECTRODE_2_SIGNAL                                          CH   /*!< TSI0 signal: CH */
#define BOARD_TSI_ELECTRODE_2_CHANNEL                                          7   /*!< TSI0 channel: 7 */
#define BOARD_TSI_ELECTRODE_2_PIN_NAME                                  TSI0_CH7   /*!< Pin name */
#define BOARD_TSI_ELECTRODE_2_LABEL                         "J1[3]/U4[4]/D2/SW2"   /*!< Label */
#define BOARD_TSI_ELECTRODE_2_NAME                             "TSI_ELECTRODE_2"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTouch(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
